In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame(
    [
        ['100', "aaa"],
        ['200', "bbb"],
        ['300', "ccc"],
    ],
    columns = ["ID", "name"]
)

In [3]:
df2 = pd.DataFrame(
    [
        ['100', 3000],
        ['200', 6000],
        ['400', 12000],
    ],
    columns = ["ID", "salary"]
)

In [5]:
display(df1)
display(df2)

    ID name
0  100  aaa
1  200  bbb
2  300  ccc

    ID  salary
0  100    3000
1  200    6000
2  400   12000

In [9]:
pd.merge(df1, df2, on ="ID", how="left")

    ID name  salary
0  100  aaa  3000.0
1  200  bbb  6000.0
2  300  ccc     NaN

In [11]:
pd.merge(df1, df2, on ="ID", how="right")

    ID name  salary
0  100  aaa    3000
1  200  bbb    6000
2  400  NaN   12000

In [12]:
pd.merge(df1, df2, on ="ID", how="outer")

    ID name   salary
0  100  aaa   3000.0
1  200  bbb   6000.0
2  300  ccc      NaN
3  400  NaN  12000.0

In [13]:
pd.merge(df1, df2, on ="ID", how="inner")

    ID name  salary
0  100  aaa    3000
1  200  bbb    6000

In [14]:
pd.merge(df1, df2, left_on ="ID", right_on ="ID", how="inner")

    ID name  salary
0  100  aaa    3000
1  200  bbb    6000